app/controllers/articles_controller.rb

  def update
    @article.update(title: params[:article][:title], description: params[:article][:description])
---
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2019-08-11 21:20:34.573631"], ["id", 1]]